Revit 2024 API
RadioButtonGroup.AddItem Method
Adds a new ToggleButton to the RadioButtonGroup.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ToggleButton AddItem(
	ToggleButtonData buttonData
)
Visual Basic
Public Function AddItem ( _
	buttonData As ToggleButtonData _
) As ToggleButton
Visual C++
public:
ToggleButton^ AddItem(
	ToggleButtonData^ buttonData
)
Parameters
buttonData
Type: Autodesk.Revit.UI.ToggleButtonData
An object containing the data needed to construct the ToggleButton.
Return Value
 The newly added ToggleButton.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException | Thrown when buttonData is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when button with buttonData.Name already exists in the group.
See Also
RadioButtonGroup Class
Autodesk.Revit.UI Namespace